class Script(object):

    START_TXT = """
✨ <b>ʜᴇʟʟᴏ {mention}, ᴡᴇʟᴄᴏᴍᴇ!</b> ✨

<blockquote expandable>ɪ ᴀᴍ <b>{bot_name}</b>. ꜱᴇɴᴅ ᴍᴇ ᴀɴʏ ꜱᴛᴏʀʏ ᴛɪᴛʟᴇ ɪɴ ᴘʀɪᴠᴀᴛᴇ ᴏʀ ɢʀᴏᴜᴘ ᴛᴏ ɢᴇᴛ ɪᴛꜱ ᴅɪʀᴇᴄᴛ ᴀᴄᴄᴇꜱꜱ ʟɪɴᴋ.</blockquote>

👇 <i>ᴜꜱᴇ ᴛʜᴇ ʙᴜᴛᴛᴏɴꜱ ʙᴇʟᴏᴡ ᴛᴏ ᴇxᴘʟᴏʀᴇ ᴍʏ ꜰᴇᴀᴛᴜʀᴇꜱ!</i>

🆔 <code>{user_id}</code>
"""

    ABOUT_TXT = """
🤖 <b>ʙᴏᴛ ɴᴀᴍᴇ:</b> {bot_name}
🆔 <b>ʏᴏᴜʀ ᴜꜱᴇʀ ɪᴅ:</b> <code>{user_id}</code>
🐍 <b>ʟᴀɴɢᴜᴀɢᴇ:</b> ᴘʏᴛʜᴏɴ 3
📚 <b>ꜰʀᴀᴍᴇᴡᴏʀᴋ:</b> ᴘʏʀᴏɢʀᴀᴍ
💾 <b>ᴅᴀᴛᴀʙᴀꜱᴇ:</b> ᴍᴏɴɢᴏᴅʙ
👨‍💻 <b>ᴅᴇᴠᴇʟᴏᴘᴇʀ:</b> <a href="{owner_link}">ᴋᴀʟᴜᴜ</a>

<blockquote expandable>ᴇɴɢɪɴᴇᴇʀᴇᴅ ᴡɪᴛʜ ʀᴀᴘɪᴅꜰᴜᴢᴢ ʟᴏɢɪᴄ ꜰᴏʀ ꜱᴍᴀʀᴛ ʀᴇᴄᴏᴍᴍᴇɴᴅᴀᴛɪᴏɴꜱ ᴇᴠᴇɴ ᴡɪᴛʜ ꜱᴘᴇʟʟɪɴɢ ᴛʏᴘᴏꜱ!</blockquote>
"""

    HELP_TXT = """
🛠 <b><u>ʜᴏᴡ ᴛᴏ ᴜꜱᴇ {bot_name}</u></b>

<blockquote expandable>1️⃣ <b>ꜱᴇᴀʀᴄʜ:</b> ᴛʏᴘᴇ ᴀɴʏ ꜱᴛᴏʀʏ ᴛɪᴛʟᴇ ᴅɪʀᴇᴄᴛʟʏ ɪɴ ɢʀᴏᴜᴘ ᴏʀ ᴘʀɪᴠᴀᴛᴇ (ᴇ.ɢ., <code>ᴠᴇᴇʀ ɢᴀᴛʜᴀ</code>).

2️⃣ <b>ᴀʟʟ ꜱᴛᴏʀɪᴇꜱ & ꜰɪʟᴛᴇʀ:</b> ᴛʏᴘᴇ /allstories ᴏʀ /filter. ᴛᴀᴘ ᴀɴʏ ꜱᴛᴏʀʏ ɴᴀᴍᴇ ᴛᴏ ᴄᴏᴘʏ ɪᴛ ɪɴꜱᴛᴀɴᴛʟʏ.

3️⃣ <b>🎲 ʀᴀɴᴅᴏᴍ ꜱᴛᴏʀʏ:</b> ᴄʟɪᴄᴋ "🎲 ꜱᴜʀᴘʀɪꜱᴇ ᴍᴇ / ʀᴀɴᴅᴏᴍ" ʙᴜᴛᴛᴏɴ to DISCOVER A RANDOM STORY INSTANTLY FROM DATABASE.

4️⃣ <b>🧩 ᴄᴀᴛᴇɢᴏʀʏ / ᴄᴀᴛᴇɢᴏʀʏ:</b> ʙʀᴏᴡꜱᴇ ꜱᴛᴏʀɪᴇꜱ ʙʏ ɢᴇɴʀᴇ ʟɪᴋᴇ ʀᴏᴍᴀɴᴄᴇ, ʜᴏʀʀᴏʀ, ᴅʀᴀᴍᴀ, ꜱᴄɪ-ꜰɪ, ᴏʀ ᴛʜʀɪʟʟᴇʀ.

5️⃣ <b>ʀᴇǫᴜᴇꜱᴛ ꜱᴛᴏʀʏ:</b> ɪꜰ ᴀ ꜱᴛᴏʀʏ ɪꜱ ɴᴏᴛ ɪɴ ᴅᴀᴛᴀʙᴀꜱᴇ, ᴛʏᴘᴇ /request &lt;ꜱᴛᴏʀʏ ɴᴀᴍᴇ&gt;.</blockquote>
"""
